content-org/all-posts.org
#+hugo_base_dir: ../
#+hugo_section: ./posts

#+hugo_weight: auto
#+hugo_auto_set_lastmod: t

#+author: T, Ivan

# do =C-c C-e H H= to export just this post.

** DONE Troubleshooting together
   :PROPERTIES:
   :EXPORT_FILE_NAME: troubleshooting-together
   :END:

*** Making Changes 
    Aside from the general best practice of making changes in a
    shared change controled environment (like not doing so without
    prio planning and communication) When troublesshooting in an
    environment that no-one is using for anything important currently,
    it's important that you can put everything back how you found
    it at the end. This helps prevent configuration drift, and breaking things
    for the next guy. 
    When troubleshooting, you should keep a detailed and time ordered
    list of the changes to configuration. So you always know what you
    changed, and how to reverse it back when your done.
    
